---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures
source: html/e0e22a7b-a98a-85be-a442-5fdcd8d8559a.htm
---
# BuiltInFailures.DocumentFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.